<details><summary>Show Plan</summary>

```

terraform
module.keystore-docdb.random_password.master_password: Refreshing state... [id=none]
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=60]
data.assert_test.workspace: Reading...
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_keyserver]
data.assert_test.workspace: Read complete after 0s
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e93280fb-403a-4a6d-ae0b-c24153d81eac]
data.aws_vpc.vpc: Reading...
module.keystore-docdb.aws_kms_key.docdb_encryption: Refreshing state... [id=2f0b0120-f9f0-4e73-a032-9b32b9d273c2]
module.ecs.data.aws_ecr_image.service_image: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/4a2b7414-8a24-4235-aa0f-b5db9efab83c]
module.keystore-docdb.aws_secretsmanager_secret.master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_keyserver_logs]
data.aws_ecr_repository.repository: Reading...
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_keyserver_ecs_task_execution_role]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=61]
module.ecs.data.aws_ecr_image.service_image: Read complete after 1s [id=sha256:01b793476375477661bb1cf4cccaa1a457ca52f161d1dd153959210f07c7d1a6]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_keyserver_cluster]
module.keystore-docdb.aws_secretsmanager_secret_version.master_password: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:898587786287:secret:staging-keyserver-keystore-docdb-master-password-jyiAwz|0A7600A4-8557-44ED-90EB-E5B26F704FC4]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 2s [id=Z098781520DYMYC4P6VDC]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z098781520DYMYC4P6VDC__d10fe09d59a830b084d8db90d6842763.staging.keys.walletconnect.com._CNAME]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633264200000003]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633263100000002]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_keyserver_ecs_task_execution_role-20230123165633261600000001]
data.aws_ecr_repository.repository: Read complete after 1s [id=keyserver]
data.aws_vpc.vpc: Read complete after 3s [id=vpc-09dce0b23af575478]
data.aws_subnets.private_subnets: Reading...
data.aws_subnets.public_subnets: Reading...
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-961/990176404ae8dc90]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-092c47b694fe8b4c8]
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0ce39c02220f9baa8]
module.keystore-docdb.aws_security_group.service_security_group: Refreshing state... [id=sg-0a0d7ee9dada4d636]
data.aws_subnets.public_subnets: Read complete after 0s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-keyserver-lb-9ae/315e0c74d54136e3]
data.aws_subnets.private_subnets: Read complete after 0s [id=eu-central-1]
module.keystore-docdb.aws_docdb_subnet_group.private_subnets: Refreshing state... [id=staging-keyserver-keystore-docdb-private-subnet-group]
module.keystore-docdb.aws_docdb_cluster.docdb_primary: Refreshing state... [id=staging-keyserver-keystore-docdb-primary-cluster]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z098781520DYMYC4P6VDC_staging.keys.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-keyserver-lb-9ae/315e0c74d54136e3/65dac46ed12af85e]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:10" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task will be created
  + resource "aws_ecs_task_definition" "app_task" {
      + arn                      = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"
      + family                   = "staging_keyserver"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/staging_keyserver_ecs_task_execution_role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

  # module.keystore-docdb.aws_docdb_cluster.docdb_primary must be replaced
-/+ resource "aws_docdb_cluster" "docdb_primary" {
      + apply_immediately               = (known after apply)
      ~ arn                             = "arn:aws:rds:eu-central-1:898587786287:cluster:staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)
      ~ availability_zones              = [
          - "eu-central-1a",
          - "eu-central-1b",
          - "eu-central-1c",
        ] -> (known after apply)
      + cluster_identifier_prefix       = (known after apply)
      ~ cluster_members                 = [] -> (known after apply)
      ~ cluster_resource_id             = "cluster-CVDKCJHUY3RMIG7Z5N7FCYEEUI" -> (known after apply)
      ~ db_cluster_parameter_group_name = "default.docdb4.0" -> (known after apply)
      - deletion_protection             = false -> null
      ~ endpoint                        = "staging-keyserver-keystore-docdb-primary-cluster.cluster-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "4.0.0" -> (known after apply)
      - global_cluster_identifier       = "" -> null
      ~ hosted_zone_id                  = "Z1ZKU8ZZR6T7FW" -> (known after apply)
      ~ id                              = "staging-keyserver-keystore-docdb-primary-cluster" -> (known after apply)
      ~ master_username                 = "relay" -> "keyserver" # forces replacement
      ~ preferred_backup_window         = "01:51-02:21" -> (known after apply)
      ~ preferred_maintenance_window    = "sat:23:40-sun:00:10" -> (known after apply)
      ~ reader_endpoint                 = "staging-keyserver-keystore-docdb-primary-cluster.cluster-ro-cnkvjbadm57i.eu-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ skip_final_snapshot             = false -> true
      - tags                            = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.keystore-docdb.aws_docdb_cluster_instance.docdb_instances[0] will be created
  + resource "aws_docdb_cluster_instance" "docdb_instances" {
      + apply_immediately            = (known after apply)
      + arn                          = (known after apply)
      + auto_minor_version_upgrade   = true
      + availability_zone            = (known after apply)
      + ca_cert_identifier           = (known after apply)
      + cluster_identifier           = (known after apply)
      + db_subnet_group_name         = (known after apply)
      + dbi_resource_id              = (known after apply)
      + endpoint                     = (known after apply)
      + engine                       = "docdb"
      + engine_version               = (known after apply)
      + id                           = (known after apply)
      + identifier                   = "staging-keyserver-keystore-docdb-primary-instance-0"
      + identifier_prefix            = (known after apply)
      + instance_class               = "db.r5.large"
      + kms_key_id                   = (known after apply)
      + port                         = (known after apply)
      + preferred_backup_window      = (known after apply)
      + preferred_maintenance_window = (known after apply)
      + promotion_tier               = 0
      + publicly_accessible          = (known after apply)
      + storage_encrypted            = (known after apply)
      + tags_all                     = {
          + "Application"      = "keyserver"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "keyserver"
          + "ProvisionedBy"    = "Terraform"
        }
      + writer                       = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*